# Challenge 3

In this challenge we will work on the `Orders.csv` data set in the previous [Subsetting and Descriptive Stats lab](../../lab-subsetting-and-descriptive-stats/your-code/main.ipynb). In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

# Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [1]:
import numpy as np
import pandas as pd

Next, import `Orders.csv` from the "subsetting" lab folder into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [2]:
orders = pd.read_csv("../../../21_descriptive_statistics/lab-subsetting-and-descriptive-stats/your-code/Orders.csv")
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [3]:
orders

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397919,541904,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.20
397920,541905,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.10,12680,France,12.60
397921,541906,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397922,541907,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397923,541908,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.85

In [16]:
#customers_unique = orders.groupby(['CustomerID', 'Country'])['amount_spent'].sum().sort_values(ascending=False).to_frame()

customers_unique = orders.groupby(['Country','CustomerID'], as_index=False).agg({'amount_spent':'sum'})
customers_unique

             Country  CustomerID  amount_spent
0          Australia       12386        401.90
1          Australia       12388       2780.66
2          Australia       12393       1582.60
3          Australia       12415     124914.53
4          Australia       12422        386.20
...              ...         ...           ...
4342  United Kingdom       18287       1837.28
4343     Unspecified       12363        552.00
4344     Unspecified       12743        546.43
4345     Unspecified       14265        530.18
4346     Unspecified       16320       1038.46

[4347 rows x 3 columns]

In [17]:
customers_unique.quantile(0.95)

CustomerID      17982.800
amount_spent     5774.278
Name: 0.95, dtype: float64

In [18]:
customers_unique.quantile(0.75)

CustomerID      16776.500
amount_spent     1661.195
Name: 0.75, dtype: float64

In [20]:
#customers_preferred = customers_unique[(customers_unique['amount_spent'] >= customers_unique['amount_spent'].quantile(.75)) & (customers_unique['amount_spent'] < customers_unique['amount_spent'].quantile(.95))].sort_values('amount_spent')

customers_preferred = customers_unique[(customers_unique['amount_spent'] > customers_unique['amount_spent'].quantile(.75)) & (customers_unique['amount_spent'] < customers_unique['amount_spent'].quantile(.95))]
customers_preferred

             Country  CustomerID  amount_spent
1          Australia       12388       2780.66
5          Australia       12424       1760.96
6          Australia       12431       5514.67
10           Austria       12360       2662.06
23           Belgium       12362       5226.23
...              ...         ...           ...
4323  United Kingdom       18259       2338.60
4324  United Kingdom       18260       2643.20
4332  United Kingdom       18272       3078.58
4341  United Kingdom       18283       2094.88
4342  United Kingdom       18287       1837.28

[869 rows x 3 columns]

In [21]:
#customers_vip = customers_unique[customers_unique['amount_spent'] >= customers_unique['amount_spent'].quantile(.95)].sort_values('amount_spent')

customers_vip = customers_unique[(customers_unique['amount_spent'] > customers_unique['amount_spent'].quantile(.95))]
customers_vip

              Country  CustomerID  amount_spent
3           Australia       12415     124914.53
59    Channel Islands       14936       8137.02
61             Cyprus       12359       6372.58
77            Denmark       12435       7829.89
80               EIRE       14156     117379.63
...               ...         ...           ...
4211   United Kingdom       18109       8052.97
4233   United Kingdom       18139       8438.34
4257   United Kingdom       18172       7561.68
4296   United Kingdom       18223       6484.54
4302   United Kingdom       18229       7276.90

[218 rows x 3 columns]

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

# Q2: How to identify which country has the most VIP Customers?

# Q3: How to identify which country has the most VIP+Preferred Customers combined?

Provide your solution for Q2 below:

In [22]:
#Q2
most_vip = customers_vip.groupby(['Country']).agg(['count'])['CustomerID'].sort_values(by='count', ascending=False)
most_vip

                 count
Country
United Kingdom     178
Germany             11
France               9
Switzerland          3
Spain                2
Portugal             2
Japan                2
EIRE                 2
Finland              1
Channel Islands      1
Netherlands          1
Norway               1
Singapore            1
Denmark              1
Sweden               1
Cyprus               1
Australia            1

In [23]:
#Q3
most_preferred_vip = customers_preferred.groupby(['Country']).agg(['count'])['CustomerID'].sort_values(by='count', ascending=False)
most_preferred_vip

                 count
Country
United Kingdom     756
Germany             28
France              20
Belgium             11
Switzerland          6
Norway               6
Spain                5
Portugal             5
Italy                5
Finland              4
Australia            3
Channel Islands      3
Israel               2
Japan                2
Denmark              2
Cyprus               2
Greece               1
Austria              1
EIRE                 1
Lebanon              1
Malta                1
Poland               1
Sweden               1
Canada               1
Iceland              1